Revit 2027 API
View3D.CreateIsometric Method
 Returns a new isometric View3D.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static View3D CreateIsometric(
	Document document,
	ElementId viewFamilyTypeId
)
Public Shared Function CreateIsometric (
	document As Document,
	viewFamilyTypeId As ElementId
) As View3D
public:
static View3D^ CreateIsometric(
	Document^ document,
	ElementId^ viewFamilyTypeId
)
static member CreateIsometric :
        document : Document *
        viewFamilyTypeId : ElementId -> View3D
Parameters
document Document
 The document to which the new View3D will be added.
viewFamilyTypeId ElementId
 The id of the ViewFamilyType which will be used by the new View3D. The type needs to be a ThreeDimensional ViewType.
Return Value
View3D
 The new isometric View3D.
Exceptions
Exception | Condition
ArgumentException |  This View Family Type is not a ThreeDimensional view type. -or- 3D view creation is not allowed in this family.
ArgumentNullException |  A non-optional argument was null
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 The new View3D will receive a unique view name. The view will be oriented in the same position as the default 3D view.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace